src/cf/InformationRegisters/НастройкиРабочихСтолов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиРабочихСтолов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеНастройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НастройкиРабочегоСтола</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/НастройкиРабочегоСтола.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>НастройкиРабочегоСтола</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВариантКомпоновки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВариантРабочегоСтола</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Масштаб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СхемаРабочегоСтола</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФоновоеОбновление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦветоваяСхема</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиРабочихСтолов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает значение настройки для указанного пользователя.
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Пользователь.
//  Настройка - ПеречислениеСсылка.НастройкиРабочегоСтола - Настройка рабочего стола.
// 
// Возвращаемое значение:
//  Произвольный - Значение настройки.
//
Функция ЗначениеНастройки(Пользователь, Настройка) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиРабочихСтолов.ЗначениеНастройки КАК ЗначениеНастройки
		|ИЗ
		|	РегистрСведений.НастройкиРабочихСтолов КАК НастройкиРабочихСтолов
		|ГДЕ
		|	НастройкиРабочихСтолов.Пользователь = &Пользователь
		|	И НастройкиРабочихСтолов.Настройка = &Настройка");
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Настройка", Настройка);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Если Не ПараметрыСеанса.ЭтоМобильныйКлиент Тогда
		ЗначениеНастройки = ?(Выборка.Следующий(), Выборка.ЗначениеНастройки.Получить(), Неопределено);
	Иначе
		ЗначениеНастройки = ?(Настройка = Перечисления.НастройкиРабочегоСтола.ВариантКомпоновки,
			Неопределено,
			?(Выборка.Следующий(), Выборка.ЗначениеНастройки.Получить(), Неопределено));
	КонецЕсли;
	
	Если ЗначениеНастройки = Неопределено Тогда
		ЗначениеНастройки = Перечисления.НастройкиРабочегоСтола.ЗначениеНастройкиПоУмолчанию(Настройка);
	КонецЕсли;
	
	Возврат ЗначениеНастройки;
	
КонецФункции

// Устанавливает значение настройки для указанного пользователя.
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Пользователь.
//  Настройка - ПеречислениеСсылка.НастройкиРабочегоСтола - Настройка рабочего стола.
//  ЗначениеНастройки - Произвольный - Значение настройки.
//
Процедура УстановитьЗначениеНастройки(Пользователь, Настройка, ЗначениеНастройки) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Отбор.Настройка.Установить(Настройка);
	
	Если ЗначениеНастройки <> Неопределено Тогда
		СтрокаНабора = НаборЗаписей.Добавить();
		СтрокаНабора.Пользователь = Пользователь;
		СтрокаНабора.Настройка = Настройка;
		СтрокаНабора.ЗначениеНастройки = Новый ХранилищеЗначения(ЗначениеНастройки);
		СтрокаНабора.ПредставлениеНастройки = Строка(ЗначениеНастройки);
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
